microresearch/allcolours/touch/software/stm32f4xx_it_2024_003.c
#include "stm32f4xx.h"
#include "stm32f4xx_dac.h"
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_adc.h"
#include "stm32f4xx_dma.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_spi.h"
#include "stm32f4xx_tim.h"
#include <sys/unistd.h>
#include <errno.h>
#include <stdlib.h>
#include <math.h>
#include <sys/stat.h>
#include <sys/times.h>
#include "misc.h"
#include "resources.h"
#include "macros000.h"

#define TOPS 0b11111111111111110000000000000000
#define BOTS 0b00000000000000001111111111111111
#define TOP 4095

// timing is critical
// and maybe we need different BRK value for: mode, freezer, rec and play - 64 and 10 are close...
#define BRKF 8 // for freezer. 8 with 24 divider ////now 48 with divider of 8; was 8 when we have have divider in main as 32... too high causes issues for speed of freezes
#define BRK 8 // 8 is for when we have mode etc toggles outside main loop // was 128 // this is for mode and other toggles...
#define DELB 42 // 40 now with 8 divider - was 20 reduced was 200 delay for pin changes in new trigger code - was 10000 but this slows down all playback so we have to reduce and rely on BRK -- is delay we hold the the freeze/toggle
#define DELA 32 // for clear DAC // was 64

#define FULLRESET 1200 // say 6 seconds
#define SOFTRESET 800 // soft - over 4 seconds
#define SHORTMODE 8 // was 20ms could be shorter...
#define LONGMODE 280 // 2 sec
#define LONGTOG 300 // 1-2 secs long press for TOGGLE->activate
//#define PLAYFULLY 24 // length of playlist in fingers.h
#define LODGEFUL 27 // 0-27 = 28 lodges
#define THRESH 2048 // threshold for masking etc...

#ifdef fouronethree
#define MAXREC 8400 // was 9000/ prev 9500 // F413===depends on RAM! // for uint32_t we have this for 128Kb -> 320k around 10k samples which is how long??? // was 7000 like 30 seconds at 32 divider...
#else
#define MAXREC 3800 // for older STM
#endif
// with F413 we have 9200 which is how long - around 20 seconds now on 24 divider

#define LOWVAL 40 // lowest value to trigger recordings

//#define MAXMODES 8

uint32_t MAXMODE[4]={8,8,8,8};

GPIO_InitTypeDef GPIO_InitStructure;
extern __IO uint32_t adc_buffer[8];

static uint32_t recordings[8][MAXREC+1]={0}; // 
static int32_t real[8], reall[8];//, realfr[8]={0,0,0,0, 0,0,0,0}; // not static????
static int32_t control[4];
static uint32_t values[8]={0,0,0,0, 0,0,0,0}; // changed 2/10 NOW STATIC!
const uint32_t whichctrl[8]={0,1,2,3,0,1,2,3}; // ref for newADC speeds
const float *playreff[4]={logfast, logslow, logfast_stop, logslow_stop}; 
static uint32_t Theldon[8]={0,0,0,0, 0,0,0,0};

static uint32_t error=0;

#include "fingers.h"

void send_command(int command, void *message)
{
   asm("mov r0, %[cmd];"
       "mov r1, %[msg];"
       "bkpt #0xAB"
         :
         : [cmd] "r" (command), [msg] "r" (message)
         : "r0", "r1", "memory");
}

char buffx[10];

void NMI_Handler(void)
{
}

void HardFault_Handler(void)
{
  while (1)
  {
  }
}

void MemManage_Handler(void)
{
  while (1)
  {
  }
}

void BusFault_Handler(void)
{
  while (1)
  {
  }
}

void UsageFault_Handler(void)
{
  while (1)
  {
  }
}

void SVC_Handler(void)
{
}

void DebugMon_Handler(void)
{
}

void PendSV_Handler(void)
{
}

#define delay()						 do {	\
    register unsigned int ix;					\
    for (ix = 0; ix < DELB; ++ix)				\
      __asm__ __volatile__ ("nop\n\t":::"memory");		\
  } while (0)

#define delay2()						 do {	\
    register unsigned int ix;					\
    for (ix = 0; ix < DELA; ++ix)				\
      __asm__ __volatile__ ("nop\n\t":::"memory");		\
  } while (0)


#define delayy()						 do {	\
    register unsigned int ix;					\
    for (ix = 0; ix < 10000000; ++ix)				\
      __asm__ __volatile__ ("nop\n\t":::"memory");		\
  } while (0)



uint32_t nosilence(uint32_t value){
  if (value>LOWVAL) return 1;
  else return 0;
}

uint32_t always(uint32_t value){
  return 1;
}


inline static uint32_t overlaylive(uint32_t value, uint32_t value2, uint32_t over){  // 2 bits = 4 options
  uint32_t tmpp;
  int32_t subs;
 	    if (over==0){ //usual - now swopped for >
	      if (value>value2) tmpp=value; // only if is more than
	      else tmpp=value2;
	    }
	    else if (over==1){ 
	      tmpp=value2+value;
	      if (tmpp>TOP) tmpp=TOP; 
	    }
	    else if (over==2){ // mod
	      tmpp=value2+value;
	      tmpp=tmpp%4096;
	    }
	    else { // subtract live and do abs...
	      subs=value2-value;
	      tmpp=abs(subs);
	    }
	    return tmpp;
}

inline static uint32_t overlayx(uint32_t value, uint32_t value2, uint32_t over){ // 3 bits = 8 options
  uint32_t tmpp; int32_t subs;
  float nn;
  over=0; // TESTY!
  if (over==0){ // solo
    tmpp=value;
  }
  else if (over==1){
    if (value>value2) tmpp=value; // only if is more than
    else tmpp=value2;
  }
  else if (over==2){ 
    tmpp=value2+value;
    if (tmpp>TOP) tmpp=TOP;
  }
  else if (over==3){ 
    tmpp=value2+value;
    tmpp=tmpp%4096;
  }
  else if (over==4){ // no silence on top
    if (value>LOWVAL) tmpp=value;
    else tmpp=value2;
    }
  else if (over==4){	    //add VCA/float thing /// but need more bits and more options
    nn=value/4095.0;
    nn*=(float)value2;
    tmpp=(uint32_t)nn;
  }
  else if (over==5){	    //add VCA/float thing /// but need more bits and more options -> 3 bits=8 options...  +2 - mask/threshold!?
    value=4095-value;
    nn=value/4095.0;
    nn*=(float)value2;
    tmpp=(uint32_t)nn;
  }
  else if (over==6){ // 	      //	      - mask/threshold
    if (value>THRESH) tmpp=value2;
    //    else tmpp=0;
  }
  return tmpp;
}

inline static void resetx(uint32_t which){
  for (uint32_t y=0;y<=MAXREC;y++){ 
    recordings[which][y]=0;
  }
}

void resett(uint32_t dacc){
  f[dacc].rec=1;
  f[dacc].rl[0].ind=0;
  f[dacc].rl[1].ind=0;					
  f[dacc].ttoggle=0;
  f[dacc].state=NR;
  f[dacc].leaverr=0;
  f[dacc].leaverp=0;
  f[dacc].active=1;
  f[dacc].masterL[0]=0;
  f[dacc].masterL[1]=0;
  f[dacc].minormode[0][0]=0;
  f[dacc].minormode[0][1]=0;
  f[dacc].minormode[0][2]=0;
  f[dacc].minormode[0][3]=0;  
  f[dacc].minormode[1][0]=0;
  f[dacc].minormode[1][1]=0;
  f[dacc].minormode[1][2]=0;
  f[dacc].minormode[1][3]=0;  
  f[dacc].majormode[0]=0;
  f[dacc].majormode[1]=0;
  f[dacc].majormode[2]=0;
  f[dacc].majormode[3]=0;  
  f[dacc].playspeed[0]=0;
  f[dacc].playspeed[1]=0;
  f[dacc].ttoggle=0;
  f[dacc].rl[0].num_lodges=0;
  f[dacc].rl[1].num_lodges=0;
  //  f[dacc].lastmode=0;
  f[dacc].sensi=0;
  f[dacc].entryd[0]=0;
  f[dacc].entryd[1]=0;
  f[dacc].entryr=0;
  f[dacc].entryrp=0;
  f[dacc].leavep=0;
  //  f[dacc].playlistm=0;
  //  f[dacc].playlistp=0;
  for (uint32_t x=0;x<8;x++){ 
    resetx(x);
  }
  // zero all lodges
  for (uint32_t y=0;y<MAXLODGE;y++){
    f[dacc].rl[0].lodges[y].function=nosilence;
    f[dacc].rl[1].lodges[y].function=nosilence;	
    f[dacc].rl[0].lodges[y].sil=0;
    f[dacc].rl[1].lodges[y].sil=0;
    f[dacc].rl[0].lodges[y].realend=0;
    f[dacc].rl[1].lodges[y].realend=0;
    f[dacc].rl[0].lodges[y].end=MAXREC;
    f[dacc].rl[1].lodges[y].end=MAXREC;
    f[dacc].rl[0].lodges[y].linkage=0;
    f[dacc].rl[1].lodges[y].linkage=0;
    f[dacc].rl[0].lodges[y].start=0;
    f[dacc].rl[1].lodges[y].start=0;
    f[dacc].rl[0].lodges[y].delcnt=0;
    f[dacc].rl[1].lodges[y].delcnt=0;
    f[dacc].rl[0].lodges[y].delcntt=0.0;
    f[dacc].rl[1].lodges[y].delcntt=0.0;
    f[dacc].rl[0].lodges[y].delay=0;
    f[dacc].rl[1].lodges[y].delay=0;
    f[dacc].rl[0].lodges[y].flag=0;
    f[dacc].rl[1].lodges[y].flag=0;
    f[dacc].rl[0].lodges[y].added=0;
    f[dacc].rl[1].lodges[y].added=0;
    f[dacc].rl[0].lodges[y].realend=0;
    f[dacc].pl[1].lodges[y].realend=0;
    f[dacc].pl[0].lodges[y].end=MAXREC;
    f[dacc].pl[1].lodges[y].end=MAXREC;
    f[dacc].pl[0].lodges[y].linkage=0;
    f[dacc].pl[1].lodges[y].linkage=0;
    f[dacc].pl[0].lodges[y].start=0;
    f[dacc].pl[1].lodges[y].start=0;
    f[dacc].pl[0].lodges[y].delcnt=0.0;
    f[dacc].pl[1].lodges[y].delcnt=0.0;
    f[dacc].pl[0].lodges[y].delcntt=0.0;
    f[dacc].pl[1].lodges[y].delcntt=0.0;
    f[dacc].pl[0].lodges[y].delay=0;
    f[dacc].pl[1].lodges[y].delay=0;
  }
}

inline static void resets(uint32_t dacc){ // soft reset of both layers
  f[dacc].masterL[0]=0;
  f[dacc].masterL[1]=0;
  f[dacc].ttoggle=0;
  f[dacc].rec=1;
  f[dacc].state=NR; // NADA
  //  f[dacc].lastmode=0;
  f[dacc].entryr=0;
  f[dacc].entryrp=0;
  f[dacc].pl[0].num_lodges=0;
  f[dacc].pl[1].num_lodges=0;
  f[dacc].rl[0].num_lodges=0;
  f[dacc].rl[1].num_lodges=0;
  
  for (uint32_t y=0;y<MAXLODGE;y++){   // zero all lodges TODO? is it necessary if we just set numlodges to 0?
    f[dacc].rl[0].lodges[y].function=nosilence;
    f[dacc].rl[1].lodges[y].function=nosilence;	
    f[dacc].rl[0].lodges[y].sil=0;
    f[dacc].rl[1].lodges[y].sil=0;
    f[dacc].rl[0].lodges[y].realend=0;
    f[dacc].rl[1].lodges[y].realend=0;
    f[dacc].rl[0].lodges[y].end=MAXREC;
    f[dacc].rl[1].lodges[y].end=MAXREC;
    f[dacc].rl[0].lodges[y].linkage=0;
    f[dacc].rl[1].lodges[y].linkage=0;
    f[dacc].rl[0].lodges[y].start=0;
    f[dacc].rl[1].lodges[y].start=0;
    f[dacc].rl[0].lodges[y].delcnt=0;
    f[dacc].rl[1].lodges[y].delcnt=0;
    f[dacc].rl[0].lodges[y].delcntt=0.0;
    f[dacc].rl[1].lodges[y].delcntt=0.0;
    f[dacc].rl[0].lodges[y].delay=0;
    f[dacc].rl[1].lodges[y].delay=0;
    f[dacc].rl[0].lodges[y].flag=0;
    f[dacc].rl[1].lodges[y].flag=0;
    f[dacc].rl[0].lodges[y].added=0;
    f[dacc].rl[1].lodges[y].added=0;
    f[dacc].rl[0].lodges[y].realend=0;
    f[dacc].pl[1].lodges[y].realend=0;
    f[dacc].pl[0].lodges[y].end=MAXREC;
    f[dacc].pl[1].lodges[y].end=MAXREC;
    f[dacc].pl[0].lodges[y].linkage=0;
    f[dacc].pl[1].lodges[y].linkage=0;
    f[dacc].pl[0].lodges[y].start=0;
    f[dacc].pl[1].lodges[y].start=0;
    f[dacc].pl[0].lodges[y].delcnt=0;
    f[dacc].pl[1].lodges[y].delcnt=0;
    f[dacc].pl[0].lodges[y].delay=0;
    f[dacc].pl[1].lodges[y].delay=0;
  }
}

inline static float mod0(float value, uint32_t length)
{
  while ((int)value > (length-1)){
        value -= length;
	//	printf("val %f length %d\n", value, length);
  }
    return value;
}

// offset is delay to start playing, start is point to start in recording, realend is end, length is length, loop is MAXREC - but can also set
// delcntt is the delay cnt
// delcnt is the index... // now unused
uint32_t playlodge(float speed1, uint32_t d, uint32_t lay, uint32_t* P_options){ 
  uint32_t x, y, tmpx, tmpxx, ff;
  uint32_t sample=0;

    for (x=0;x<f[d].pl[lay].num_lodges;x++){
    f[d].pl[lay].lodges[x].delcntt=mod0(f[d].pl[lay].lodges[x].delcntt+speed1, (f[d].pl[lay].lodges[x].offset+f[d].pl[lay].lodges[x].length+f[d].pl[lay].lodges[x].delay));
  }

    for (x=0;x<f[d].pl[lay].num_lodges;x++){
      if (f[d].pl[lay].lodges[x].delcntt>=f[d].pl[lay].lodges[x].offset && (f[d].pl[lay].lodges[x].delcntt<=(f[d].pl[lay].lodges[x].offset+f[d].pl[lay].lodges[x].length))) {
	tmpx=fmod(((f[d].pl[lay].lodges[x].delcntt-f[d].pl[lay].lodges[x].offset)+f[d].pl[lay].lodges[x].start),MAXREC); // but if we overlap ???
	
	if (tmpx>=MAXREC) tmpx=MAXREC-1; // safety

	if (lay==0) {
	  sample=overlayx(recordings[d][tmpx]&TOP, sample, (P_options[0]>>5)&3); // deal with overlap of zones in one layer DONE
	  f[d].pl[lay].lodges[x].currentval=recordings[d][tmpx]&TOP; // currentval
	}
	else {
	  sample=overlayx(recordings[d][tmpx]>>16, sample, (P_options[0]>>5)&3); // top layer
	  f[d].pl[lay].lodges[x].currentval=recordings[d][tmpx]>>16; // currentval
	}
      }
        }
    return sample;
}

static uint32_t lastvalue[8]={0,0,0,0, 0,0,0,0};

void reclayerupper(uint32_t value, uint32_t place, uint32_t d){
  if (place>=MAXREC) place=MAXREC-1;
  recordings[d][place]=(recordings[d][place]&TOP)+(value<<16);
}

