microresearch/allcolours/touch/software/stm32f4xx_it_2024_003.c
void reclayerlower(uint32_t value, uint32_t place, uint32_t d){
  if (place>=MAXREC) place=MAXREC-1;
  recordings[d][place]=(recordings[d][place]&TOPS)+(value);
}

// from playlodge:
// offset is delay to start playing, start is point to start in recording, realend is end, length is length, loop is end (normally MAXREC)
// delcntt is the delay cnt
// delcnt is the recording index...
uint32_t reclodge(uint32_t lay, layersr *rec, uint32_t d, uint32_t value, uint32_t* R_options, uint32_t masterL, uint32_t swoptype){ // pass in all and the p/layers
  uint32_t x, y, tmpx, tmpxx;
  for (x=0;x<rec[lay].num_lodges;x++){
    if (rec[lay].lodges[x].flag==0 && rec[lay].lodges[x].function(value)) {
      rec[lay].lodges[x].delcntt++;

      if (rec[lay].lodges[x].delcntt>=(rec[lay].lodges[x].offset+rec[lay].lodges[x].lengthr+rec[lay].lodges[x].delay)) rec[lay].lodges[x].delcntt=0;

      if (rec[lay].lodges[x].delcntt>=rec[lay].lodges[x].offset && (rec[lay].lodges[x].delcntt<=(rec[lay].lodges[x].offset+rec[lay].lodges[x].lengthr))){
	if (rec[lay].lodges[x].over==0){
	if ((rec[lay].lodges[x].delcnt+rec[lay].lodges[x].start)>=rec[lay].lodges[0].end) {
	  rec[lay].lodges[x].delcnt=0;
	  rec[lay].lodges[x].over=1; 
	}
	} // over==1
	else {
	if ((rec[lay].lodges[x].delcnt)>=rec[lay].lodges[0].end) {
	  rec[lay].lodges[x].delcnt=0;
	  rec[lay].lodges[x].over=1; 
	}
	}
	if (rec[lay].lodges[x].over==0)	tmpx=rec[lay].lodges[x].delcnt+rec[lay].lodges[x].start;
	else tmpx=rec[lay].lodges[x].delcnt;

	rec[lay].lodges[x].realend=tmpx;
	rec[lay].lodges[x].length++;
	rec[lay].lodges[x].delcnt++;
	
	if (swoptype==1){ 
	if (masterL==0){
	  if (lay==0){
	    tmpxx=overlayx(value, (recordings[d][tmpx]&TOP), (R_options[0])&3);
	    reclayerlower(tmpxx, tmpx, d);
	  }
	  else {
	    tmpxx=overlayx(value, (recordings[d][tmpx]>>16), (R_options[0])&3); // fixed
	    reclayerupper(tmpxx, tmpx, d); 
	  }	    
	} // masterL
	else {
	  if (lay==1){
	    tmpxx=overlayx(value, (recordings[d][tmpx]&TOP), (R_options[0])&3);
	    reclayerlower(tmpxx, tmpx, d);
	  }
	  else { // 0
	    tmpxx=overlayx(value, (recordings[d][tmpx]>>16), (R_options[0])&3); // fixed
	    reclayerupper(tmpxx, tmpx, d); 
	  }	    
	}
      } // swoptype
      else { // swop is zero so layer depends on lay
	  if (lay==0){
	    tmpxx=overlayx(value, (recordings[d][tmpx]&TOP), (R_options[0])&3);
	    reclayerlower(tmpxx, tmpx, d);
	  }
	  else {
	    tmpxx=overlayx(value, (recordings[d][tmpx]>>16), (R_options[0])&3); // fixed
	    reclayerupper(tmpxx, tmpx, d); 
	  }
      } // swoptype
      }
    }
  }
  return tmpxx;
}

inline static void copyin(uint32_t d, uint32_t l, uint32_t reset){
  uint32_t x;
  // copy in rec zones to play zones
  //  reset=1;
    f[d].pl[l].num_lodges=f[d].rl[l].num_lodges;
    for (x=0;x<f[d].rl[l].num_lodges;x++){
      //      f[d].pl[l].lodges[x].delcntt=f[d].rl[0].lodges[x].delcntt; 
      f[d].pl[l].lodges[x].offset=f[d].rl[l].lodges[x].offset;
      f[d].pl[l].lodges[x].delay=f[d].rl[l].lodges[x].delay;
      f[d].pl[l].lodges[x].start=f[d].rl[l].lodges[x].start;
      f[d].pl[l].lodges[x].realend=f[d].rl[l].lodges[x].realend;
      f[d].pl[l].lodges[x].length=f[d].rl[l].lodges[x].length;
      reset=1; // TESTY!
      if (reset){ // reset play to beginning
      f[d].pl[l].lodges[x].delcntt=0.0;
      f[d].pl[l].lodges[x].delcnt=0.0;
      }
      else if (f[d].rl[l].lodges[x].added) { // if we added zone beyond 0
	f[d].pl[l].lodges[x].delcnt=f[d].rl[l].lodges[x].delcnt;
	if (x!=0) f[d].pl[l].lodges[x].delcntt=f[d].pl[l].lodges[x-1].delcntt; // prev delcntt
	else f[d].pl[l].lodges[0].delcntt=0.0;
	f[d].rl[l].lodges[x].added=0;
      }
    }
}

////////////////////////////////////////////////////////////////////////////////

inline static void extendlodge(uint32_t d, uint32_t lay, uint32_t (*func)(uint32_t val)){
  uint32_t tt;
  if (f[d].rl[lay].num_lodges==0){
  f[d].rl[lay].num_lodges=1;
  f[d].rl[lay].lodges[0].function=func;
  f[d].rl[lay].lodges[0].flag=0; 
  f[d].rl[lay].lodges[0].start=0;
  f[d].rl[lay].lodges[0].length=0; // length=0, lengthr=MAXREC, end=MAXREC = extendible
  f[d].rl[lay].lodges[0].offset=0;
  f[d].rl[lay].lodges[0].delcnt=0;
  f[d].rl[lay].lodges[0].delcntt=0; 
  f[d].rl[lay].lodges[0].delay=0; 
  f[d].rl[lay].lodges[0].lengthr=MAXREC; // but could be longer???
  f[d].rl[lay].lodges[0].end=MAXREC;
  }
  else {
    tt=f[d].rl[lay].num_lodges-1;
    if (tt!=0) f[d].rl[lay].lodges[tt].delcnt=f[d].rl[lay].lodges[tt-1].realend; // previous end ?? TESTY!
    f[d].rl[lay].lodges[tt].lengthr=MAXREC; 
    f[d].rl[lay].lodges[tt].flag=0;
  }
}

inline static void addlodge(uint32_t d, uint32_t lay, uint32_t sil, uint32_t (*func)(uint32_t val)){
  uint32_t tmpx;
    f[d].rl[lay].num_lodges+=1;
    if (f[d].rl[lay].num_lodges>MAXLODGE) f[d].rl[lay].num_lodges=1;
    if (f[d].rl[lay].num_lodges==1){ // first lodge
      f[d].rl[lay].lodges[0].function=func;
      f[d].rl[lay].lodges[0].length=0;
      f[d].rl[lay].lodges[0].delcnt=0;
      f[d].rl[lay].lodges[0].delcntt=0.0;
      f[d].rl[lay].lodges[0].start=0;
      f[d].rl[lay].lodges[0].offset=0;
      f[d].rl[lay].lodges[0].sil=sil;
      f[d].rl[lay].rcnt=0;
      f[d].rl[lay].lodges[0].delay=0; // looping???
      f[d].rl[lay].lodges[0].lengthr=MAXREC; // but could be longer???
      f[d].rl[lay].lodges[0].end=MAXREC;
      f[d].rl[lay].lodges[0].flag=0;
      f[d].rl[lay].lodges[0].over=0; 
    } // first lodge
    else { // lodge>1
      tmpx=f[d].rl[lay].num_lodges-1;
      f[d].rl[lay].lodges[tmpx].over=0; 
      f[d].rl[lay].lodges[tmpx].added=1;
      f[d].rl[lay].lodges[tmpx].function=func;
      f[d].rl[lay].lodges[tmpx].length=0;
      f[d].rl[lay].lodges[tmpx].flag=0;
      f[d].rl[lay].lodges[tmpx].delcnt=0;
      f[d].rl[lay].lodges[tmpx].delcntt=f[d].rl[lay].lodges[tmpx-1].delcntt;
      f[d].rl[lay].lodges[tmpx].start=f[d].rl[lay].lodges[tmpx-1].realend+1; 
      f[d].rl[lay].lodges[tmpx].offset=(f[d].rl[lay].lodges[tmpx-1].realend)+1; // start right away
      f[d].rl[lay].lodges[tmpx].sil=sil;
      f[d].rl[lay].rcnt=0;
      f[d].rl[lay].lodges[tmpx].delay=0; // to come later
      f[d].rl[lay].lodges[tmpx].end=MAXREC; 
      f[d].rl[lay].lodges[tmpx].lengthr=MAXREC; // but could be longer???
      f[d].rl[lay].lodges[tmpx-1].flag=1; // stop the last one TODO: remember to reset
    }
}

////

