microresearch/allcolours/touch/software/stm32f4xx_it_2024_003.c
// if there are no lodges we just have one, otherwise we extend the last lodge
uint32_t R_basic(uint32_t d, uint32_t V_options, uint32_t* R_options){
  uint32_t tmp, tmpp, swoptype;  
  //  LAYERSWOPR;

  if (f[d].entryr==0){ // includes reset now - only on entry set these
    // what to reset?    
    lastvalue[d]=0;
    f[d].entryr=1;
    f[d].leaverr=1;
    extendlodge(d,0, always);
    extendlodge(d,1, always);
  }
    tmp=real[d];
    tmpp=control[whichctrl[d]];
    SWOP;
    return tmp;
  }

/* eg. addlodgex
entry 
swop
addlodges: abstract that out for each layer as function
reclodges
*/

uint32_t Mnosilence(uint32_t d, uint32_t lay, uint32_t val){
  uint32_t tmpx;
  if (val>LOWVAL) { // start recording layer 0
    f[d].rl[0].ind=1;
    if (f[d].entryd[0]==0){
      addlodge(d,0,0,nosilence);
      f[d].entryd[0]=1;
    } // on entry we add lodge and also on each new silence...
  } // above val
  else { 
      // low value but did we leave recording
      if (f[d].rl[0].ind==1){ // we were recording so set end point of last one and add all delays
	tmpx=f[d].rl[0].num_lodges-1; // lodge we just left
	for (uint32_t x=0;x<tmpx;x++){ // previous lodges
	  f[d].rl[0].lodges[x].delay+=f[d].rl[0].lodges[tmpx].length+1;
	}
	f[d].rl[0].ind=0; f[d].entryd[0]=0;
      }
  }  
}

uint32_t (*Mfunc[4])(uint32_t d, uint32_t lay, uint32_t val)={Mnosilence};

uint32_t NR_addlodgex(uint32_t d, uint32_t V_options, uint32_t* R_options){ // generic one and now manilodges is the function pointer
  uint32_t tmp, tmpp, other, tmpx, swoptype;
  // 1//ENTRY
  if (f[d].entryr==0){ 
    f[d].entryr=1;
    f[d].leaverr=1;
    f[d].entryd[0]=0;
    f[d].entryd[1]=0;
    f[d].rl[0].ind=0;
    f[d].rl[1].ind=0;
  }

  // 2//SWOPPAGE
  //  LAYERSWOPR;
  //  swoptype=(R_options[0]|R_options[1])&1;
  //  if (swoptype==0){  // swop values
  //    if (f[d].masterL[0]==0){
  tmp=real[d];
  tmpp=control[whichctrl[d]]; 
  //    }
  //    else {
  //  tmpp=real[d];
  //  tmp=control[whichctrl[d]]; 
  //    } // swop values only
  //  }

  // 3. manipulation of lodges:
  //call pointer for function depending on mode
  //  	  values[d]=(*NRfunc[f[d].majormode[NR]])(d, V_options, R_options); // TESTY!
  (*Mfunc[f[d].majormode[NR]])(d, 0, tmp);
  (*Mfunc[f[d].majormode[NR]])(d, 1, tmpp);

  // 4. RECLODGE
  reclodge(0, f[d].rl, d, tmp, R_options, f[d].masterL[0], swoptype); // so we just extend the last lodge // only rec on >LOWVAL but how to pull out
  reclodge(1, f[d].rl, d, tmpp, R_options, f[d].masterL[0], swoptype); // so we just extend the last lodge
  return tmp;
}

uint32_t R_addlodges(uint32_t d, uint32_t V_options, uint32_t* R_options){ // each succesive rec mode adds one zone
  uint32_t tmp, tmpp, other, tmpx, swoptype;
  uint32_t res[2];
  if (f[d].entryr==0){ // includes reset now
    f[d].entryr=1;
    f[d].leaverr=1;
    f[d].entryd[0]=0;
    f[d].entryd[1]=0;
    addlodge(d, 0, 0, always);
    addlodge(d, 1, 0, always);
    } // entry

  //  LAYERSWOPR;
  tmp=real[d];
  tmpp=control[whichctrl[d]]; 

  f[d].rl[0].ind=1;
  f[d].rl[1].ind=1; 
  SWOP;
  return tmp;
}

void R_addlodges_leave(uint32_t d){
  uint32_t tmpx;  // if we were recording then close it...
  if (f[d].rl[0].ind==1){ 
    tmpx=f[d].rl[0].num_lodges-1; // lodge we just left
    for (uint32_t x=0;x<tmpx;x++){ // previous lodges
      f[d].rl[0].lodges[x].delay+=(f[d].rl[0].lodges[tmpx].length);
    }
    f[d].rl[0].ind=0;
  }
  // layer2
    if (f[d].rl[1].ind==1){ 
    tmpx=f[d].rl[1].num_lodges-1; // lodge we just left
    for (uint32_t x=0;x<tmpx;x++){ // previous lodges
      f[d].rl[1].lodges[x].delay+=(f[d].rl[1].lodges[tmpx].length);
    }
    f[d].rl[1].ind=0;
  }

  f[d].leaverr=0;
}

uint32_t R_addlodges_silence(uint32_t d, uint32_t V_options, uint32_t* R_options){ // add zones on press and offset is silence
  uint32_t tmpp, other, tmpx, tmp, swoptype;
  uint32_t res[2];
  if (f[d].entryr==0){ // includes reset now
    // what to reset?    
    lastvalue[d]=0;
    f[d].entryr=1;
    f[d].leaverr=1;
    f[d].entryd[0]=0;
    f[d].entryd[1]=0;
    f[d].rl[0].ind=0;
    f[d].rl[1].ind=0;
    f[d].rl[0].rcnt=0;
    f[d].rl[1].rcnt=0;
  }
  
  //  LAYERSWOPR;
  swoptype=(R_options[0]|R_options[1])&1;
  //  if (swoptype==0){  
  //    if (f[d].masterL[0]==0){
      tmp=real[d];
      tmpp=control[whichctrl[d]]; 
      //    }
      //    else {
      //  tmpp=real[d];
      //  tmp=control[whichctrl[d]]; 
      //    } 
      //  }
  
  f[d].rl[0].rcnt++;
  if (tmp>LOWVAL) { // start recording
    f[d].rl[0].ind=1;
    if (f[d].entryd[0]==0){
    addlodge(d, 0, f[d].rl[0].rcnt, nosilence);
    f[d].entryd[0]=1;
    } // entry
  } // above val
  else { 
    if (f[d].rl[0].ind==1){ 
      tmpx=f[d].rl[0].num_lodges-1; // lodge we just left
	for (uint32_t x=0;x<tmpx;x++){ // previous lodges
	  f[d].rl[0].lodges[x].delay+=f[d].rl[0].lodges[tmpx].length+1+f[d].rl[0].lodges[tmpx].sil;
	}
	if (tmpx!=0) f[d].rl[0].lodges[tmpx].offset=f[d].rl[0].lodges[tmpx-1].length+f[d].rl[0].lodges[tmpx].sil+f[d].rl[0].lodges[tmpx-1].offset; // add in previous offset???
	else f[d].rl[0].lodges[0].offset=f[d].rl[0].lodges[0].sil;
	  f[d].rl[0].ind=0;
	  f[d].entryd[0]=0;
	  f[d].rl[0].rcnt=0;
    } // ind
  } ////////////////////////lower
  // layer2
    f[d].rl[1].rcnt++;
  if (tmpp>LOWVAL) { // start recording
    f[d].rl[1].ind=1;
    if (f[d].entryd[1]==0){
    addlodge(d,1,f[d].rl[1].rcnt, nosilence);
    f[d].entryd[1]=1;
    } // entry
  } // above val
  else { 
    if (f[d].rl[1].ind==1){ 
      tmpx=f[d].rl[1].num_lodges-1; // lodge we just left
	for (uint32_t x=0;x<tmpx;x++){ // previous lodges
	  f[d].rl[1].lodges[x].delay+=f[d].rl[1].lodges[tmpx].length+1+f[d].rl[0].lodges[tmpx].sil;
	}
	if (tmpx!=0) f[d].rl[1].lodges[tmpx].offset=f[d].rl[1].lodges[tmpx-1].length+f[d].rl[1].lodges[tmpx].sil+f[d].rl[1].lodges[tmpx-1].offset; // add in previous offset???
	else f[d].rl[1].lodges[0].offset=f[d].rl[1].lodges[0].sil;
	  f[d].rl[1].ind=0;
	  f[d].entryd[1]=0;
	  f[d].rl[1].rcnt=0;
    } // ind
  }
  reclodge(0, f[d].rl, d, tmp, R_options, f[d].masterL[0], swoptype); 
  reclodge(1, f[d].rl, d, tmp, R_options, f[d].masterL[0], swoptype);
  return real[d];
}

void R_addlodges_leave_silence(uint32_t d){ // no add of apres-silence
  uint32_t tmpx;  // if we were recording then close it...
      if (f[d].rl[0].ind==1){ 
      tmpx=f[d].rl[0].num_lodges-1; // lodge we just left
	for (uint32_t x=0;x<tmpx;x++){ // previous lodges
	  f[d].rl[0].lodges[x].delay+=f[d].rl[0].lodges[tmpx].length+f[d].rl[0].lodges[tmpx].sil;
	}
	if (tmpx!=0) f[d].rl[0].lodges[tmpx].offset=(f[d].rl[0].lodges[tmpx-1].length)+f[d].rl[0].lodges[tmpx].sil+f[d].rl[0].lodges[tmpx-1].offset; // add in previous offset???
	  else f[d].rl[0].lodges[0].offset=f[d].rl[0].lodges[0].sil;
	  f[d].rl[0].ind=0;
	  f[d].rl[0].rcnt=0;
      }

