microresearch/allcolours/touch/software/stm32f4xx_it_2024_003.c
      if (f[d].rl[1].ind==1){ 
      tmpx=f[d].rl[1].num_lodges-1; // lodge we just left
	for (uint32_t x=0;x<tmpx;x++){ // previous lodges
	  f[d].rl[1].lodges[x].delay+=(f[d].rl[1].lodges[tmpx].length+1)+f[d].rl[1].lodges[tmpx].sil;
	}
	if (tmpx!=0) f[d].rl[1].lodges[tmpx].offset=(f[d].rl[1].lodges[tmpx-1].length)+f[d].rl[1].lodges[tmpx].sil+f[d].rl[1].lodges[tmpx-1].offset; // add in previous offset???
	  else f[d].rl[1].lodges[0].offset=f[d].rl[1].lodges[0].sil;
	  f[d].rl[1].ind=0;
	  f[d].rl[1].rcnt=0;
      }
      f[d].leaverr=0;
}


void R_nothing_leave(uint32_t d){
  f[d].leaverr=0;
}

void P_nothing_leave(uint32_t d){
  f[d].leavep=0;
}

void RP_nothing_leave(uint32_t d){
  f[d].leaverp=0;
}



// basic RP mode: just write new values to existing lodges, playback existing lodges 
// we play playback plus real/overlay and record different options...
uint32_t RP_basic(uint32_t d, uint32_t V_options, uint32_t* P_options, uint32_t* R_options, uint32_t *RP_options){
  uint32_t pp, other, tmpp, tmp, tmpx, x, pbopt, res, ress, swoptype;
  pbopt=((RP_options[0]>>1)&1) | ((R_options[1]>>1)&1);
  if (f[d].entryrp==0){
    f[d].leaverp=1;
    f[d].entryrp=1;
    f[d].leaverp=1;
    tmpx=f[d].rl[0].num_lodges-1; // lodge we just left - close this one... // R is masterL[0], P is masterL[1]
    //    f[d].rl[0].lodges[tmpx].end=f[d].rl[0].lodges[tmpx].realend;
    tmpx=f[d].rl[1].num_lodges-1; // lodge we just left - close this one... // R is masterL[0], P is masterL[1]
    //    f[d].rl[1].lodges[tmpx].end=f[d].rl[1].lodges[tmpx].realend;
    copyin(d, 0, P_options[1]&1);
    copyin(d, 1, P_options[1]&1);
  } // entryrp
  // play
  //  LAYERSWOPRP; // swop both layers TODO: as option just to swop one = 3 bits

  swoptype=(R_options[0]|R_options[1])&1;
  if (swoptype==0){  // swop values
    if (f[d].masterL[0]==0){
  tmp=real[d];
  tmpp=control[whichctrl[d]]; // we use CTRL as speed
    }
    else {
  tmpp=real[d];
  tmp=control[whichctrl[d]]; // we use CTRL as speed
    } // swop values only
  }

  float speedy=playreff[f[d].playspeed[f[d].masterL[1]]][(control[whichctrl[d]]>>2)]; // speed from CTRL or from layer
  ress=playlodge(speedy, d, 0, P_options);
  playlodge(speedy, d, 1, P_options);
  // record overlay on zones on both layers - question of swops!

  res=reclodge(0, f[d].rl, d, tmp, R_options, f[d].masterL[0], swoptype);
  reclodge(1, f[d].rl, d, tmpp, R_options, f[d].masterL[0], swoptype); 

  if (pbopt==0){
    tmp=overlaylive(real[d], ress, (P_options[f[d].masterL[1]]>>3)&3);
  }
  else
    {
      tmp=res;//overlaylive(real[d], res, (P_options[f[d].masterL[1]]>>3)&3);
    }

  return tmp;
}
//uint32_t (*RPfunc[2])(uint32_t d, uint32_t V_options, uint32_t* R_options, uint32_t* RP_options)={P_basic};
uint32_t P_basic(uint32_t d, uint32_t V_options, uint32_t* R_options, uint32_t* RP_options){  // CTRL live is speed
  uint32_t pp, x, otherl;
  uint32_t res;
  if (f[d].entryrp==0){
    //    lastvalue[d]=0;
    f[d].entryrp=1;
    f[d].leavep=1;
    copyin(d, 0, (RP_options[1]&1));
    copyin(d, 1, (RP_options[1]&1));
  }
  //  LAYERSWOP;
  float speedy=playreff[f[d].playspeed[f[d].masterL[1]]][(control[whichctrl[d]]>>2)]; // speed from CTRL
  uint32_t tmp=real[d];
  res=playlodge(speedy, d, 0, RP_options); //TODO: swoppy
  playlodge(speedy, d, 1, RP_options); // we ignore that value???

  tmp=overlaylive(tmp, res, (RP_options[f[d].masterL[1]]>>3)&3); // overlay of live value! - 
  return tmp;
}

uint32_t N_basic(uint32_t d, uint32_t V_options){
  uint32_t tmp=real[d];
  DOFREEZE;
  return tmp;
}

//uint32_t (*Nfunc[2])(uint32_t d, uint32_t V_options)={N_basic};
uint32_t (*NRfunc[4])(uint32_t d, uint32_t V_options, uint32_t* R_options)={R_basic, R_addlodges, R_addlodges_silence};
uint32_t (*RPfunc[2])(uint32_t d, uint32_t V_options, uint32_t* R_options, uint32_t* RP_options)={P_basic};

void (*NRfunc_leave[4])(uint32_t d)={R_nothing_leave, R_addlodges_leave, R_addlodges_leave, R_addlodges_leave_silence};
void (*RPfunc_leave[2])(uint32_t d)={RP_nothing_leave};


// STARTY
void TIM2_IRQHandler(void) 
  {
    uint32_t speed=0;
    float spd=0.0; // for new accel tests
    static uint32_t d=0;
    uint32_t j,x,y, tmp, tmpp, tmpy, autre;
    uint32_t freezer[8]={1<<8, 1<<4, 1<<13, 1<< 15,  1<<9, 1<<12, 1<<3, 1<<4}; // 1st 4 are vca, last 4 are volts   - changed FR6 to PB3 now!
    static uint32_t modetoggle=0, newmode=0, count=0;
    static uint32_t lasttriggered[11]={0,0,0,0, 0,0,0,0, 0,0,0}, mbreaker=0, breaker[11]={0,0,0,0, 0,0,0,0, 0,0,0};
    static int32_t togrec=0, togplay=0, helder=0, heldon=0, modeheld=0, modechanged=1, first=0;
    static uint32_t Theld[8]={0,0,0,0, 0,0,0,0};
    static uint32_t Thelder[8]={0,0,0,0, 0,0,0,0};
    static uint32_t Newtog[8]={0,0,0,0, 0,0,0,0};      
    uint32_t V_options, R_options[2], P_options[2], RP_options[2];
    const uint32_t SENSESHIFTS[3]={0,1,2}; // just use first 2 for now
    const uint32_t SENSEOFFSETS[3]={120,560,1800}; // TODO - adjust maybe for RP
    //    const uint32_t remode[4]={0,1,2,2}; // 2 arrays N, R and P/RP
	      
    if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET) 
    {
        TIM_ClearITPendingBit(TIM2, TIM_IT_Update);

	// micromodes outside mode switches - these will change with new scheme
	/*
	V_options=f[d].minormode[0][0]&1; // V: sens, sync/global-overlay= 3 bits - top [6] syncs to [4] to test
	R_options[0]=f[d].minormode[0][1]&3; // was??6 bits  2bits overlay ctrl + 2 bits x2 for 2nd tape overlay options
	R_options[1]=f[d].minormode[1][1]&3; // 
	
	P_options[0]=f[d].minormode[0][2]&127; // P,RP: 11 speedarray, 11 live overlay + now zone overlay // 6 bits + reset option=7 bits
	P_options[1]=f[d].minormode[1][2]&127; // 
	
	RP_options[0]=(f[d].minormode[0][3]&31); // RP: type of swop, type of playback, overlay of live onto rec layer
	RP_options[1]=(f[d].minormode[1][3]&31); 
	
	f[d].sensi=V_options&1; // first bit - sensitivity is in macros
	f[d].playspeed[0]=(P_options[0]>>1)&3; // speedarray = 2 bits
	f[d].playspeed[1]=(P_options[1]>>1)&3; // speedarray = 2 bits
	*/
	// functions outside switch
	FREEZERS;
	REALADC;
	CTRL;

	/* // new scheme
	  toggle only: swop/reset that section
	  toggle+modifier: state(N/RP), mode, micromode [mode/micromode->advance]
	  toggle+CTRL: params on zones -> P or R zones
	  CTRL+modifier: ???  CTRL is local to 2 sections - can also be micromode/mode advance or params on zones...
	*/
	
