microresearch/allcolours/touch/software/stm32f4xx_it_2024_003.c
	// toggle only: swop/reset that section // swop we have in macros but doesn't exclude mods
		if (Newtog[d]){ // newtog means there has been a release
		  Newtog[d]=0;
		  if (Theld[d]>LONGTOG) { 
		    Theld[d]=0;
		    // reset this one
		    resets(d);
		  }
		  f[d].ttoggle=0; // this is more for logic below...
		}

	if (f[d].ttoggle){
	  if (togrec) {
	    Thelder[d]=0; // reset the reset toggle for the above: to test
	    f[d].rec^=1; // is now just state	    
	  }
	}

	// logic is: we are in NR or RP only
	if (f[d].rec) f[d].state=NR;
	else if (f[d].rl[f[d].masterL[0]].num_lodges>0) f[d].state=RP; // and only if we have a lodge!
	else f[d].state=NR;
	
	////// TESTY - SET MODES for testing!
	f[d].majormode[NR]=0;
	f[d].majormode[RP]=0;
	///////////////////////////////////////////////////////
	
	// NR: TODO: geomantic mode thing - could be only for all modes which are active
	if (f[d].state==NR){ 
	  //RESETFRR; // ????
	  values[d]=NR_addlodgex(d, V_options, R_options); //uint32_t NR_addlodgex(uint32_t d, uint32_t V_options, uint32_t* R_options){ // generic one and now manilodges is the function pointer
	} // end NADA
	else {
	  if (f[d].leaverr){ 
	    (*NRfunc_leave[f[d].majormode[NR]])(d);
	  }
	    f[d].entryr=0;
	}
	// REC+PLAY: ADC->speed/bounce/rec to other // freeze is swop // what does voltage do (overlay same tape minormodes here)
	if (f[d].state==RP){ 
	  //	  RESETFRRP;  /// ????
	  values[d]=(*RPfunc[f[d].majormode[RP]])(d, V_options, R_options, RP_options);
	} //end RP
	else {
	  if (f[d].leaverp){ 
	    (*RPfunc_leave[f[d].majormode[RP]])(d);
	  }
	  f[d].entryrp=0;
    }
	
	///////////////////////////////////////////////////////	

	WRITEDAC2;
	d++;
	if (d==8) {
	  d=0;
	  count++;
	  togplay=0; togrec=0; // here as then we set them for one round
	  TEST_TOGGLES;      // only place where toggles
	  /*
	    toggle only: swop/reset that section
	    toggle+modifier: state(N/RP), mode, micromode [mode/micromode->advance] // and what of full reset of that one
	    toggle+CTRL: params on zones -> P or R zones
	    CTRL+modifier: ???  CTRL is local to 2 sections - can also be micromode/mode advance or params on zones...
	  */
	  
	  if (newmode){ // newmode is the release of mode
	    newmode=0;
	    breaker[10]=0;

	    if (modeheld>FULLRESET) { //reset all // keep this - only if there is no toggle
	      modeheld=0;
	      resett(0);
	      resett(1);
	      resett(2);
	      resett(3);
	      resett(4);
	      resett(5);
	      resett(6);
	      resett(7);
	    }
	}
    }
    }
  }
